using System.Collections;
using System.Collections.Generic;
using UnityEngine;

// TODO :: 내일 할일
// 1. 상점 구현
// 1-1. 플레이어 스테이터스에 상점으로 연결되게 추가
// 2. 인벤토리 구현 [할 차례]

public class annotation
{
    // ※ 플레이어
    // [프로필]
    // 이름 / 레벨 / 경험치 / 직업 / 칭호
    // [스테이터스 투자]
    // 근력 : 공격력 / 치명타 데미지 / 방어력
    // 민첩 : 공격속도 / 이동속도 / 명중률 / 회피확률
    // 지능 : 마법 공격력 / 마법 치명타데미지 / 마법 저항
    // 지혜 : 최대마나 / 초당 마나회복량 / 받은 마나회복량(물약 포함X)
    // 체력 : 최대체력 / 초당 체력회복량 / 받은 체력회복량(물약 포함O)
    // 행운 : 치명타 확률 / 아이템 획득 확률 / 특수 아이템 획득 확률 / 특수 이벤트 확률
    // [장비]
    // 투구
    // 목걸이
    // 갑옷
    // 무기
    // 장갑
    // 신발
    // 반지   
    // 펫
    // 
    // 
    // 
    // ※ 메뉴창 리스트
    // 스테이터스
    // 인벤토리
    // 퀘스트ㅇ
    // 메뉴
    // 출석ㅇ
    // 우편ㅇ
    // 스킬ㅇ
    // 세팅
}
